# Классика декораторов.
# Написать декоратор timer, который измеряет время выполнения декорируемой функции

# Как посчитать длительность в секундах
# import time
# start = time.perf_counter()
# end = time.perf_counter()
# duration = end - start


# @timer
# def waste_some_time(num_times):
#     for _ in range(num_times):
#         sum([i ** 2 for i in range(10000)])
#
#     return f'{num_times} times wasted'
#
#
# result = waste_some_time(5)
# print(result)


# Finished in 0.0029 secs
# 5 times wasted
